Revit 2023 API
GroupTypeId.ElectricalLighting Property
 "Electrical - Lighting"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId ElectricalLighting { get; }
Visual Basic
Public Shared ReadOnly Property ElectricalLighting As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ElectricalLighting {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace